Autodesk.Revit.UI.FaceBasedPlacementType
This enumerated type specifies options available for placement of a face-based family instance.
Since:
2017

Autodesk.Revit.UI.FaceBasedPlacementType.PlaceOnWorkPlane
Placement on current workplane.

Autodesk.Revit.UI.FaceBasedPlacementType.PlaceOnFace
Placement on a selected face from existing geometry.

Autodesk.Revit.UI.FaceBasedPlacementType.PlaceOnVerticalFace
Placement on a vertical face.

Autodesk.Revit.UI.FaceBasedPlacementType.Default
Placement the instance which is not face-based.